Revit 2027 API
ParameterTypeId.DoorFrameMaterial Property
 "Frame Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DoorFrameMaterial { get; }
Public Shared ReadOnly Property DoorFrameMaterial As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DoorFrameMaterial {
	ForgeTypeId^ get ();
}
static member DoorFrameMaterial : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace